glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32620.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32620</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32620 and MAX32621 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>
      <release version="1.0.2" date="2018-04-19">
         - Updated pack to use latest version of CMSIS.
         - Updated Keil MDK and IAR example projects.
      </release>
      <release version="1.0.1" date="2018-04-18">
         - Fixed all example projects to use RTE_Components_h for defines and removed project specific defines.
            - Projects now all compile correctly without modification to the project options.
      </release>
      <release version="1.0.0" date="2018-04-12">
         - First major release
         - Adding links to bsp images to web site rather than local
         - Addline links to documentation to web site rather than local
      </release>
      <release version="0.0.1" date="2018-03-06">
         - Updated Keil projects to set c99 to 1 and remove the manually entered compiler option.
         - IAR Support
         - Keil Support
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32620</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>MAX32621</keyword>
      <keyword>MAX32620</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <packages>
         <package name="CMSIS" vendor="ARM"/>
      </packages>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>

   <devices>
      <family Dfamily="MAX32620" Dvendor="Maxim:23">
         <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         <compile header="Libraries/Device/Maxim/MAX32620/Include/max32620.h" />
         <debug svd="SVD/MAX32620/max32620.svd" />
         <description>
            The MAX32620 device family is designed for wearable and portable medical and fitness applications. The devices contain an ARM Cortex-M4 processor with FPU, execute up to 96MHz and include a 10-bit ADC and a versatile set of on-chip peripherals.
         </description>
         <book name="http://infocenter.arm.com/help/topic/com.arm.doc.dui0553a/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
         <book name="https://datasheets.maximintegrated.com/en/ds/MAX32620.pdf" title="MAX32620 Datasheet"/>
         <book name="http://pdfserv.maximintegrated.com/en/an/AN6242.pdf" title="MAX32620 User Guide"/>
         <feature type="Timer" n="12" m="16" name="32-Bit Timers reconfigurable as 2x16-Bit Timers"/>
         <feature type="Timer" n="6" m="32"/>
         <feature type="DMA" n="6" name="Peripheral Managment Unit"/>
         <feature type="IOs" n="49"/>
         <feature type="WDT" n="3"/>
         <feature type="RTC" n="32768"/>
         <feature type="ADC" n="10" m="10" name="Sigma-Delta ADC, 7.8ksps, Two 5.5V tolerant inputs, Two 1.2V tolerant inputs"/>
         <feature type="TimerOther" n="16" name="Channel Pulse Train Engine"/>
         <feature type="SDIO" n="3" m="4" name="x1, x2 and x4 SDIO Interface"/>
         <feature type="SPI" n="3" m="24000000" name="3 SPI Masters"/>
         <feature type="SPI" n="1" m="24000000" name="1 SPI Slave"/>
         <feature type="ExtBus" n="4" name="SPI XiP at up to 24MHz for memory expansion"/>
         <feature type="I2C" n="3" name="3 I2C Masters"/>
         <feature type="I2C" n="1" name="1 I2C Slave"/>
         <feature type="UART" n="4" m="115200"/>
         <feature type="ComOther" n="1" name="1-Wire Master"/>
         <feature type="USBD" n="1" name="Full-Speed USB Device"/>
         <feature type="VCC" n="1.2" name="Core Supply Voltage"/>
         <feature type="VCC" n="1.8" m="3.6" name="1.8V - 3.6V VDD with I/O Supply Selectable Between 1.8V and 3.6V"/>
         <feature type="Temp" n="-40" m="85"/>
         <feature type="PowerMode" n="4" name="LP3 Run, LP2 PMU, LP1 Standby, LP0 Stop"/>
         <feature type="CoreOther" n="1" name="CRC Calculation Unit"/>
         <feature type="ClockOther" n="96000000" name="Internal Relaxation Oscillator with +/- 1% accuracy"/>
         <feature type="ClockOther" n="4000000" name="Low Power 4MHz Internal Ring Oscillator"/>
         <feature type="Crypto" n="128.256" name="128/256-bit Hareware Accelerated AES Encryption Engine"/>
         <memory id="IROM1" start="0x00000000" size="0x00200000" startup="1" default="1"/>
         <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
         <device Dname="MAX32621">
            <processor Dclock="96000000"/>
            <debugconfig default="jtag" clock="1000000" swj="1"/>
            <compile header="Libraries/Device/Maxim/MAX32620/Include/max32620.h"/>
            <memory id="IROM1" start="0x00000000" size="0x00200000" startup="1" default="1"/>
            <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
            <algorithm name="Flash/MAX32620.FLM" start="0x00000000" size="0x00200000" default="1"/>
            <algorithm  name="FlashIAR/FlashMAX32620.flash" start="0x00000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x00020000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32620/max32620.svd"/>
         </device>
         <device Dname="MAX32620">
            <processor Dclock="96000000"/>
            <debugconfig default="jtag" clock="1000000" swj="1"/>
            <compile header="Libraries/Device/Maxim/MAX32620/Include/max32620.h"/>
            <memory id="IROM1" start="0x00000000" size="0x00200000" startup="1" default="1"/>
            <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
            <algorithm name="Flash/MAX32620.FLM" start="0x00000000" size="0x00200000" default="1"/>
            <algorithm  name="FlashIAR/FlashMAX32620.flash" start="0x00000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x00020000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32620/max32620.svd"/>
         </device>
      </family>

   </devices>

