glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32620.pdsc
      <example name="LP_WakeupTime" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32620_EVKIT/LP_WakeupTime">
         <description>Low Power Modes 0 and 1 wake up time measurement.</description>
         <board name="MAX32620_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_WakeupTime.uvprojx"/>
            <environment name="iar" load="IAR/LP_WakeupTime.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32620 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Low Power</keyword>
            <keyword>Wakeup</keyword>
            <keyword>GPIO</keyword>
            <keyword>External Interrupts</keyword>
         </attributes>
      </example>

      <example name="LP_Watchdog" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32620_EVKIT/LP_Watchdog">
         <description>Low Power Mode with Watchdog.</description>
         <board name="MAX32620_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_Watchdog.uvprojx"/>
            <environment name="iar" load="IAR/LP_Watchdog.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32620 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Watchdog Timers</keyword>
         </attributes>
      </example>

      <example name="Pulse_Train" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32620_EVKIT/Pulse_Train">
         <description>Pulse Train Generation Example</description>
         <board name="MAX32620_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Pulse_Train.uvprojx"/>
            <environment name="iar" load="IAR/Pulse_Train.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32620 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Pulse Train"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Pulse Train Engine</keyword>
         </attributes>
      </example>

      <example name="RTC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32620_EVKIT/RTC">
         <description>RTC example showing use of alarms and snooze features</description>
         <board name="MAX32620_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/RTC.uvprojx"/>
            <environment name="iar" load="IAR/RTC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32620 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="RTC"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Real-Time Clock</keyword>
         </attributes>
      </example>

      <example name="RTX_Blinky" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32620_EVKIT/RTX_Blinky">
         <description>CMSIS-RTOS Blinky</description>
         <board name="MAX32620_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/RTX_Blinky.uvprojx"/>
            <environment name="iar" load="IAR/RTX_Blinky.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32620 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="RTOS"/>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="ARM Compiler" Cclass="Compiler" Cgroup="Event Recorder" Cvariant="DAP"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>CMSIS-RTX</keyword>
            <keyword>RTOS</keyword>
         </attributes>
      </example>

      <example name="SPIM_MX25" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32620_EVKIT/SPIM_MX25">
         <description>SPI Master Example showing use of the on-board MX25 Flash for Storage</description>
         <board name="MAX32620_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SPIM_MX25.uvprojx"/>
            <environment name="iar" load="IAR/SPIM_MX25.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32620 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32620 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI Master</keyword>
         </attributes>
      </example>

