glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32620.pdsc
      <condition id="MAX3262X CMSIS-CORE">
         <description>Maxim MAX32620 Series devices and CMSIS-CORE</description>
         <accept Cgroup="CORE" Cclass="CMSIS"/>
         <accept condition="MAX32620 Device"/>
         <accept condition="MAX32621 Device"/>
      </condition>

      <condition id="Startup ARM">
         <description>Startup files for the Keil/ARMCC Toolchains</description>
         <require Tcompiler="ARMCC"/>
      </condition>

      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <condition id="MAX32620 CMSIS ADC">
         <description>ADC Interface</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS AES">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS CRC">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS GPIO">
         <description>GPIO Interface Layer</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS I2C Master">
         <description>I2C Master Interface</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>


      </condition>
      <condition id="MAX32620 CMSIS I2C Slave">
         <description>I2C Slave Interface</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32621 CMSIS MAA">
         <description>Modular Arithmetic Accelerator</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Dname="MAX32621"/>
      </condition>

      <condition id="MAX32620 CMSIS 1-Wire">
         <description>1-Wire Master Interface</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS PMU">
         <description>Peripheral Management Unit for DMA</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS Pulse Train">
         <description>Pulse Train (PWM) Controller</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS RTC">
         <description>Real Time Clock</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS Flash IAP">
         <description>In-Application Flash Programming</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS SPI Master">
         <description>SPI Master Interface</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS SPI Slave">
         <description>SPI Slave Interface</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS SPI XIP">
         <description>SPI eXecute In Place</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS TIMER">
         <description>32/16-Bit Timers</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 CMSIS WDT1">
         <description>Watchdog Timer 1</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS WDT2">
         <description>Watchdog Timer 2</description>
         <require condition="MAX3262X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32620 CMSIS UART">
         <description>UART</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32620 BSP">
         <description>Board Support Package</description>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="HAL" Cgroup="Hardware Access Layer"/>
         <require Cclass="Communications" Cgroup="SPI Master"/>
         <require Cclass="Communications" Cgroup="I2C Master"/>
         <require Cclass="Communications" Cgroup="UART"/>
      </condition>

      <condition id="Maxim USB">
         <description>MAXUSB Libraries</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX3262X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="HAL" Cgroup="Hardware Access Layer"/>
      </condition>

   </conditions>

   <components>
      <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="MAX32620 Device">
         <description>System Startup for Maxim MAX32620 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32620   /* Target Device Part Number */
               #define TARGET_REV 0x4332 /* Target Device Revision Number */
               #define TARGET_NUM 32620 /* Just the part target number */
               #define MXC_ADC_REV 1    /* ADC revision on the target */
               #define MXC_ASSERT_ENABLE /* Assertion checking for the API */
         </RTE_Components_h>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX32620/Include/"/>
            <file category="include" name="Libraries/MAX32620PeriphDriver/Include/"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/ARM/startup_max32620.s" version="1.0.1" condition="Startup ARM"/>

            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/GCC/startup_max32620.S" version="1.0.1" condition="Startup GCC"/>

