glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32620.pdsc
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/IAR/startup_max32620.s" version="1.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/IAR/low_level_init.c" version="1.0.1" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/IAR/cmain.s" version="1.0.1" condition="Startup IAR"/>

            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/system_max32620.c" version="1.0.1" />
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/nvic_table.c" version="1.0.1"/>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32620/Include/max32620.h" version="1.0.1" />
         </files>
      </component>

      <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="MAX32621 Device">
         <description>System Startup for Maxim MAX32621 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32620   /* Target Device Part Number */
               #define TARGET_REV 0x4332 /* Target Device Revision Number */
               #define TARGET_NUM 32620 /* Just the part target number */
               #define MXC_ADC_REV 1    /* ADC revision on the target */
               #define MXC_ASSERT_ENABLE /* Assertion checking for the API */
         </RTE_Components_h>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX32620/Include/"/>
            <file category="include" name="Libraries/MAX32620PeriphDriver/Include/"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/ARM/startup_max32620.s" version="1.0.1" condition="Startup ARM"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/GCC/startup_max32620.S" version="1.0.1" condition="Startup GCC"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/IAR/startup_max32620.s" version="1.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/IAR/low_level_init.c" version="1.0.1" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/IAR/cmain.s" version="1.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX32620/Source/system_max32620.c" version="1.0.1" />
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/nvic_table.c" version="1.0.1"/>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32620/Include/max32620.h" version="1.0.1" />
         </files>
      </component>

      <component Cclass="HAL" Cgroup="Hardware Access Layer" Cversion="1.0.1" condition="MAX3262X CMSIS-CORE">
         <description>Hardware Access Layer and System Configuration</description>
         <files>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32620/Include/max32620.h" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/clkman.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/flc.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/icc.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/lp.c" version="1.0.1"/>
            <file category="header" attr="config" name="Libraries/MAX32620PeriphDriver/Include/mxc_config.h" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/mxc_assert.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/mxc_lock.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/mxc_sys.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="ADC" Cversion="1.0.1" condition="MAX32620 CMSIS ADC">
         <description>ADC Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/adc.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Trust Protection Unit" Cgroup="AES" Cversion="1.0.1" condition="MAX32620 CMSIS AES">
         <description>AES Hardware Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/aes.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="CRC" Cversion="1.0.1" condition="MAX32620 CMSIS CRC">
         <description>CRC Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/crc.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="GPIO" Cversion="1.0.1" condition="MAX32620 CMSIS GPIO">
         <description>GPIO</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/gpio.c" version="1.0.1"/>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/ioman.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C Master" Cversion="1.0.1" condition="MAX32620 CMSIS I2C Master">
         <description>I2C Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/i2cm.c" version="1.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C Slave" Cversion="1.0.1" condition="MAX32620 CMSIS I2C Slave">
         <description>I2C Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32620PeriphDriver/Source/i2cs.c" version="1.0.1"/>
         </files>
      </component>

